[ { "name" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "price" : "50", "author" : "Various", "description" : "Grahams Magazine was a nineteenth-century periodical based in Philadelphia established by George Rex Graham and published from 1841 to 1858. It was alternatively referred to as Grahams Lady's and Gentleman's Magazine", "url" : "./BooksHTML/Grahams Magazine, Vol. XXX, No. 2, February 1847.htm", "cover" : "./BooksCover/Grahams Magazine, Vol. XXX, No. 2, February 1847.jpg", "genre" : "History", "Featured" : "1"},
{ "name" : "A Life of Walt Whitman", "price" : "30", "author" : "Henry Bryan Binns", "description" : "This 1905 biography of the great American poet, written thirteen years after his death, was notable for the speculative introduction of a New Orleans romance between Whitman and a Creole woman—an affair that most biographers reject today.  Still, Binns's volume remains one of the foundational books of Whitman scholarship—a book striving to tell of Whitman the man without placing a definite value on his work.", "url" : "./BooksHTML/A Life of Walt Whitman.htm", "cover" : "./BooksCover/A Life of Walt Whitman.jpg", "genre" : "Biography", "featured" : "1"},
{ "name" : "Literary Landmarks of Venice", "price" : "15", "author" : "Laurence Hutton", "description" : "This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book.", "url" : "./BooksHTML/Literary Landmarks of Venice.htm", "cover" : "./BooksCover/Literary Landmarks of Venice.jpg", "genre" : "History", "Featured" : "1"},
{ "name" : "Mazeppa", "price" : "25", "author" : "Frederick Whishaw", "description" : "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work.This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.As a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.", "url" : "./BooksHTML/Mazeppa.htm", "cover" : "./BooksCover/Mazeppa.jpg", "genre" : "History", "featured" : "0"},
{ "name" : "Adventures of Huckleberry Finn", "price" : "22", "author" : "Mark Twain", "description" : "Huck Finn, cruelly abused by his drunken father, joins up with Jim, a runaway slave, and heads down the Mississippi River on a raft. Along the way, they encounter a deadly feud, a pair of con artists, and other characters from the pre-Civil War South. All the while, Huck's conscience and basic decency wrestle with his society-bred ideas about race and slavery and right and wrong.", "url" : "./BooksHTML/Adventures of Huckleberry Finn.htm", "cover" : "./BooksCover/Adventures of Huckleberry Finn.jpg", "genre" : "Adventure", "featured" : "0"},
{ "name" : "The Adventures of Tom Sawyer", "price" : "14", "author" : "Mark Twain", "description" : "The Adventures of Tom Sawyer.With an introduction by Robert Maniquis. Mark Twain's novel is one of the first American literary masterpieces, embracing local vernacular to personify the unique small-town culture of this fledgling nation. Twain drew the adventures of the mischievous yet heroic Tom Sawyer from his own youth in a riverside Missouri town in the 1840s, and created perhaps the finest book about boyhood ever writtten. The Adventures of Tom Sawyer is at once a comic and poignant story about the fears and fantasies of a boy's world, and a brilliant satire of the culture and institutions of the times. One of this beloved author's most widely read works, it is hailed as an American classic.", "url" : "./BooksHTML/The Adventures of Tom Sawyer.htm", "cover" : "./BooksCover/The Adventures of Tom Sawyer.jpg", "genre" : "Adventure", "featured" : "0"},
{ "name" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "price" : "34", "author" : "Charles Dickens", "description" : "A Christmas Carol in Prose, Being a Ghost-Story of Christmas, commonly known as A Christmas Carol, is a novella by Charles Dickens, first published in London by Chapman & Hall in 1843; the first edition was illustrated by John Leech. A Christmas Carol tells the story of Ebenezer Scrooge, an old miser who is visited by the ghost of his former business partner Jacob Marley and the Ghosts of Christmas Past, Present and Yet to Come. After their visits Scrooge is transformed into a kinder, gentler man.", "url" : "./BooksHTML/A Christmas Carol in Prose Being a Ghost Story of Christmas.htm", "cover" : "./BooksCover/A Christmas Carol in Prose Being a Ghost Story of Christmas.jpg", "genre" : "Horror", "featured" : "1"},
{ "name" : "Dracula", "price" : "24", "author" : "Bram Stoker", "description" : "A rich selection of background and source materials is provided in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and Dracula's Guest, the original opening chapter to Dracula. Reviews and Reactions reprints five early reviews of the novel. Dramatic and Film Variations focuses on theater and film adaptations of Dracula, two indications of the novel's unwavering appeal. David J. Skal, Gregory A. Waller, and Nina Auerbach offer their varied perspectives. Checklists of both dramatic and film adaptations are included.", "url" : "./BooksHTML/Dracula.htm", "cover" : "./BooksCover/Dracula.jpg", "genre" : "Horror", "featured" : "1"},
{ "name" : "The Autobiography of Benjamin Franklin", "price" : "18", "author" : "Benjamin Franklin", "description" : "The Autobiography of Benjamin Franklin is the traditional name for the unfinished record of his own life written by Benjamin Franklin from 1771 to 1790; however, Franklin himself appears to have called the work his Memoirs.", "url" : "./BooksHTML/The Autobiography of Benjamin Franklin.htm", "cover" : "./BooksCover/The Autobiography of Benjamin Franklin.jpg", "genre" : "Biography", "featured" : "0"},
{ "name" : "The Count of Monte Cristo, Illustrated", "price" : "29", "author" : "Alexandre Dumas", "description" : "In 1815 Edmond Dantès, a young and successful merchant sailor who has just recently been granted the succession of his erstwhile captain Leclère, returns to Marseille to marry his Catalan fiancée Mercédès. Thrown in prison for a crime he has not committed, Edmond Dantès is confined to the grim fortress of If. There he learns of a great hoard of treasure hidden on the Isle of Monte Cristo and he becomes determined not only to escape, but also to unearth the treasure and use it to plot the destruction of the three men responsible for his incarceration.", "url" : "./BooksHTML/The Count of Monte Cristo, Illustrated.htm", "cover" : "./BooksCover/The Count of Monte Cristo, Illustrated.jpg", "genre" : "Adventure", "featured" : "0"}]