[{ "username" : "lucas", "bookName" : "A Life of Walt Whitman", "content" : "Fine research about a very interesting life, but it's a shame that a biography about an author who could write so beautifully, should itself be so poorly written. How could this sentence get past an editor \"Instead of glories Whitman had horrors previously unimaginable strung like beads on his smallest sights and hearings.\"", "accepted" : "1" , "reviewDate" : "2018-01-15 02:50:15.0"},
{ "username" : "misho", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "The Buntline Special is one of the worst examples of either Steampunk or Weird West that I have ever come across. With characters/historical figures as rich as the Earps and Doc Holliday, you would think this wouldn't be an issue... but from a pure lack of description of characters and the town, to the blandest shoot outs I've ever read, the Special falls flat on its face.", "accepted" : "1" , "reviewDate" : "2018-02-15 02:50:15.0"},
{ "username" : "samer", "bookName" : "Literary Landmarks of Venice", "content" : "Like eating fancy dessert at a gourmet restaurant, Memoirs of a Geisha is beautiful, melts lightly off the tongue and will be forgotten shortly after it's done. The language is strikingly lovely, and Golden paints a remarkable picture of a time and place. ", "accepted" : "1" , "reviewDate" : "2018-03-15 02:50:15.0"},
{ "username" : "samer", "bookName" : "Mazeppa", "content" : "One of the books I have enjoyed reading most, I literarly could not stop reading.", "accepted" : "1" , "reviewDate" : "2018-04-15 02:50:15.0"},
{ "username" : "groot", "bookName" : "Adventures of Huckleberry Finn", "content" : "Story-making and telling is what we do as human beings. Through stories we create meaning out of thin air, in the same way that plants create their food from light, and usually with about the same level of casual unconsciousness. We then learn to share meaning and thereby create language and societies. We call this culture and have little idea what it means or how it works.", "accepted" : "1" , "reviewDate" : "2018-05-15 02:50:15.0"},
{ "username" : "groot", "bookName" : "The Adventures of Tom Sawyer", "content" : "The true source of the fantasy fiction drama. Tolkien has spawned so many fantasy writers since The Lord Of The Rings went into print. I love all the earlier ones too like Verne and Carrol and CS Lewis but The Hobbit and The Lord Of The Rings its like an institution.", "accepted" : "1" , "reviewDate" : "2018-06-15 02:50:15.0"},
{ "username" : "thor", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "A reading of the original version of this story should be a part of every child's experience. In the stratosphere of literature, few books become classics -- stories that are beloved by every succeeding generation, handed down from parent to child, treasured in family libraries, and always in print.", "accepted" : "1" , "reviewDate" : "2018-07-15 02:50:15.0"},
{ "username" : "thor", "bookName" : "Dracula", "content" : "racula isn't a book, not anymore. Dracula is a name, a broad stereotyping of a character which encompasses many different components and interpretations of our favourite Count. Having been a fan of the concept of vampires for some time, earlier this year I was intrigued to return to the beginning of the vampire genre when I first picked up this book.", "accepted" : "1" , "reviewDate" : "2018-08-15 02:50:15.0"},
{ "username" : "batman", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "This is a curious little book. As an autobiography it suffers from the fact that it leaves out nearly all of the most interesting parts of Franklin’s life. This is a bit like reading an autobiography of John Lennon that ends a few years before he meets Paul McCartney. I’m not saying there is no interest in what is here, but any sort of version of such a man’s life that ends well short of the American Revolution is more than a little heart breaking.", "accepted" : "1" , "reviewDate" : "2018-09-15 02:50:15.0"},
{ "username" : "batman", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "Readers generally think of this as a tale of revenge. For me, it was much deeper. I'm not a religious person at all, but for me this is a book that makes you question the existence of God or a god. Edmond Dantes is without flaw, a truly good person, and his life is ruined because a) others envy him and b) he was the victim of an unfortunate coincidence. ", "accepted" : "1" , "reviewDate" : "2018-10-15 02:50:15.0"},
{ "username" : "groot", "bookName" : "A Life of Walt Whitman", "content" : "Kaplan brings to life one of America's greatest, and most enigmatic, literary figures. In every way intimate, Kaplan's greatest achievements are, first, the portrait of an artist on the verge of greatness, and, second, a tender vision of a great artist's final days. If you love Whitman's poetry, you must love this book, too.", "accepted" : "1" , "reviewDate" : "2017-01-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "his one was a fun, rollicking read. I love westerns, and I think Resnick did great with this different view of the history of Tombstone involving the Earps, Doc Holiday, Bat Masterson, and the Cowboys. Recommended to western fans who like a little weird, steampunk fantasy vibe.", "accepted" : "1" , "reviewDate" : "2017-02-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "Literary Landmarks of Venice", "content" : "I did not like the book, it was really hard reading it until the end, and the only reason I had is because I have heard that it was good. ", "accepted" : "1" , "reviewDate" : "2017-03-15 02:50:15.0"},
{ "username" : "hulk", "bookName" : "Mazeppa", "content" : "The title poem is a story recounted by a much older Mazeppa, a military commander with a Swedish king, retreating after the Battle of Poltava. He recounts how he learned his horse riding skills during his youth when he was a page in the Polish royal court. At that time, he fell in love with the wife of one of the Counts and they met secretly to make love.", "accepted" : "1" , "reviewDate" : "2017-04-15 02:50:15.0"},
{ "username" : "hulk", "bookName" : "Adventures of Huckleberry Finn", "content" : "What happens when stories, particularly stories about stories, are inhibited or forbidden? The most important result: society goes mad. And that part of society which becomes most mad is that of the professional story-tellers who, because they are the carriers of the essential human and cultural talent, become less than human. They are unable to tell the stories needed by the rest of us and enter a dream-like state of inexplicability and meaninglessness. ", "accepted" : "1" , "reviewDate" : "2017-05-15 02:50:15.0"},
{ "username" : "james", "bookName" : "The Adventures of Tom Sawyer", "content" : "Save time... watch the movies. This book can appeal only to a linguist. The underlying story is great, but it is buried under an avalance of horribly annoying songs and poems that do nothing to advance the story. They just take up space. I diligently read every last one, hoping that they held some deep meaning in relation to the story, but if there is one, it is so obscure that it serves no purpose. Also, the book is all about walking. ", "accepted" : "1" , "reviewDate" : "2017-06-15 02:50:15.0"},
{ "username" : "james", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "Sixteen years after Leviticus Blue reputedly robbed a string of banks and released the Blight using his drilling machine, the Boneshaker, his son Ezekiel goes back into the walled remains of Seattle, braving rotters and Doornails, to clear his name. His mother, Briar Wilkes, goes into the walled wasteland to bring him out. Can she find Zeke before Dr. Minnericht finds him?", "accepted" : "1" , "reviewDate" : "2017-07-15 02:50:15.0"},
{ "username" : "spiderman", "bookName" : "Dracula", "content" : "The novel is a fascinating entity, not least because of the differences from the modern perception of it. For example, there is the fact that the Count himself isn't hurt by sunlight, a concept which was only introduced in the silent film Nosferatu many years later. This fact is indicative of a problem which arises for any modern reader of Stoker's novel, namely, we're modern and so have a lot of pop culture baggage to contend with whenever we try to get drawn into the novel.", "accepted" : "1" , "reviewDate" : "2017-08-15 02:50:15.0"},
{ "username" : "spiderman", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "The charm and pleasure of this book, for me, is that it is not about the famous Benjamin Franklin, the inventor and one of the fathers of the American Revolution, but that it is about the young Franklin; about his education and apprenticeship as a printer to his brother, about his love of books and his determination to improve his writing skills, about how he uprooted himself from his birthplace and family and moved.", "accepted" : "1" , "reviewDate" : "2017-09-15 02:50:15.0"},
{ "username" : "misho", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "Why did no one tell me about this book? I mean seriously, I was about a hundred pages in and I wanted to go find my freshman high school English teacher and inflict terrible, intricate revenge on her for depriving me of a great book. I figured first I could assume a new identity, perhaps insinuating myself into her life. I'd make her trust me and put all her faith in me, and then I would UTTERLY CRUSH HER!!! MWAH-HA-HA-HA!!!!", "accepted" : "1" , "reviewDate" : "2017-10-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "A Life of Walt Whitman", "content" : "A solid overview of the life of WW. Took it up as I was re-reading the preface to the 1855 edition and realized I wanted some context. This bio served that purpose, though the steam seemed to run out after the period of the civil war. Was that the biographer or the life itself?", "accepted" : "1" , "reviewDate" : "2016-01-15 02:50:15.0"},
{ "username" : "batman", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "To be frank, I can’t even find something good about this book that isn’t stretching the truth. It seems, despite how prolific Resnick is, he writes like Stephenie Meyer. That is to say, he writes but doesn’t seem to bother with things like improvement. Come to think of it, he doesn’t bother with things like creating a coherent narrative, or anything else that you discuss if you participate in a basic fiction writing workshop. ", "accepted" : "1" , "reviewDate" : "2016-02-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "Literary Landmarks of Venice", "content" : "The only character I liked was Mameha, and she's the angel of the story, meaning that you're just supposed to like her because she's, well, perfect, kind, loyal and beautiful, the way Agnes is in David Copperfield or Melanie in Gone With The Wind.", "accepted" : "1" , "reviewDate" : "2016-03-15 02:50:15.0"},
{ "username" : "superman", "bookName" : "Mazeppa", "content" : " They were caught and he was strapped naked to a wild horse and set off into the country, presumably to die. Mazeppa survived the ordeal, but oh the writing as the horse flies through the countryside, forest and water.", "accepted" : "1" , "reviewDate" : "2016-04-15 02:50:15.0"},
{ "username" : "jack", "bookName" : "Adventures of Huckleberry Finn", "content" : "The Master and Margarita is obviously a satire, a purposeful distortion of language to demonstrate its corrupt use. It is also obviously meant to recall the necessity for religious stories in a society that has degraded and mocked them. But for me the book is less about the corruption of Soviet society and its attitude toward the Christian religion and more about the even more fundamental beliefs that are the unspoken tenets of story-telling, that is to say, the philosophy of literature. ", "accepted" : "1" , "reviewDate" : "2016-05-15 02:50:15.0"},
{ "username" : "hulk", "bookName" : "The Adventures of Tom Sawyer", "content" : "Those books that balloon into virulent, lethal pop-culture viruses that feast on disinterested bystanders. You try to flee them by hiding in a disused warehouse under a soiled mattress in the Democratic Republic of Congo, but Frodo and his friends will find you eventually and pull you into their lair of medieval gimps called Bilbo and Bongo on an implausibly long and homoerotic quest for a misplaced ring. Did they look behind the sofa? Under the fridge? This whole quest could have been avoided! ", "accepted" : "1" , "reviewDate" : "2016-06-15 02:50:15.0"},
{ "username" : "samer", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "Started off slow, but I fully realize that was a miscalibration with the story compatibility recognizer. I don't really do the mother-hen story line, and I often get the urge to slap headstrong teenage boys. I started this on vacation in NYC, and we just weren't getting along.", "accepted" : "1" , "reviewDate" : "2016-07-15 02:50:15.0"},
{ "username" : "james", "bookName" : "Dracula", "content" : "Dracula: the very name instantly brings to mind visions of vampires, stakes, garlic and crucifixes. But when one bothers to read the novel they may realise how twisted modern vampire fiction has become.", "accepted" : "1" , "reviewDate" : "2016-08-15 02:50:15.0"},
{ "username" : "flash", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "Franklin is a sly and entertaining narrator. He does not shy from making himself look bad on occasion, but it's clearly calculated to gain the reader's sympathy and goodwill. He's a schmoozer and a schemer, but he schmoozes and schemes to (what he perceives to be) the common good, not to his own betterment.", "accepted" : "1" , "reviewDate" : "2016-09-15 02:50:15.0"},
{ "username" : "james", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "Picture this: you are nineteen years old with your whole life ahead of you, you've just been offered the job of your dreams, and you're about to marry the person you've loved since childhood... when suddenly a couple of jealous men decide to frame you as a Bonapartist (a crime which was punished by death or life imprisonment) and have you sent away to rot in an island prison. Let's just say you'd be feeling a touch bitter about the whole ordeal.", "accepted" : "1" , "reviewDate" : "2016-10-15 02:50:15.0"},
{ "username" : "flash", "bookName" : "A Life of Walt Whitman", "content" : "Whitman remains enigmatic. I think I enjoy literary biography though. The idea of balancing a life against a body of literature provides a lot of opportunity for the author to write about the subject without really making official concrete statements about the subjects life. This biography is old and feels of its time. The treatment of Whitman's sexuality is cursory and safe, but present. The war years take up a lot of space, but honestly feel periphery to the the rest of the book. ", "accepted" : "1" , "reviewDate" : "2015-01-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "Speaking of characterization, I was also incredibly disappointed to find that Geronimo was portrayed as childish and, above all, two faced (as we see at the end of the book). Unfortunately, Resnick seems to think the stereotypical approach to Native Americans is in vogue for Weird West books. Unfortunately for him, he missed that memo, as well. Even the medicine man that helps Doc and the rest of the crew is not only the worst sort of two-dimensional, but just as stereotypical. ", "accepted" : "1" , "reviewDate" : "2015-02-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "Literary Landmarks of Venice", "content" : "I became fascinated with Japanese culture when I was a teenage girl and since then I have read many Japanese-related books and articles and have watched many movies and animes that depict parts of Japanese culture but the fact remains that I am not Japanese, I have never been to Japan and I am a foreigner, captivated by this exotic and very different culture.", "accepted" : "1" , "reviewDate" : "2015-03-15 02:50:15.0"},
{ "username" : "logan", "bookName" : "Mazeppa", "content" : "I felt like I was on the horse, with the language and flow of the meter. A very exciting poem that touches on many Romantic themes. I loved the descriptions of nature, the horse Mazeppa is on as well as a band of wild horses he encounters. Despair, wonder, excitement, passion, loss: all swirl round. Byron was also a vegetarian and his love of animals comes out in one section on the wild horse", "accepted" : "1" , "reviewDate" : "2015-04-15 02:50:15.0"},
{ "username" : "aaron", "bookName" : "Adventures of Huckleberry Finn", "content" : "This is not to say that literature should cause trouble for religion. The use of language is itself a religious experience even when it is used to parody religion as in Bulgakov's Communion of Sinners Ball and demonic Eucharist. Literature, consequently, exists as a spiritual (and social) rather than a material (and merely sensory) process. Materialism, of a Marxist, Capitalist, Scientific or any other sort, tells a story that cannot account for where its story comes from.", "accepted" : "1" , "reviewDate" : "2015-05-15 02:50:15.0"},
{ "username" : "aaron", "bookName" : "The Adventures of Tom Sawyer", "content" : "This is one volume consisting of some 1200 pages of small print and containing the three books which were really only one novel and which we erroneously refer to as a trilogy. The advantage of lugging this hefty door-stopper around wherever you go is primarily psychological. If you feel the need to disappear from this here society for a while, for example, you can just toss this in your backpack and you know that wherever you go, you will survive, somehow.", "accepted" : "1" , "reviewDate" : "2015-06-15 02:50:15.0"},
{ "username" : "wolv", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "Story alternates between the viewpoint of Ezekiel, a young teen, and that of his mother, Briar Wilkes, a hard-working widow. She was married to an inventor, Leviticus Blue, who built a machine that was supposed to impress the Russians with it's gold-mining skill. Except before the debut, things go a little haywire and a bank or two is robbed instead, and a mysterious low-lying gas released into the local atmosphere. ", "accepted" : "1" , "reviewDate" : "2015-07-15 02:50:15.0"},
{ "username" : "wolv", "bookName" : "Dracula", "content" : "Dracula is, of course, one of the most renowned horror stories, and the most well-known vampire novel. Bram Stoker set the ground rules for what a vampire should be, and set the benchmark for all other writers of the vampire afterwards. Indeed, if tyrannical villains are a necessity of Gothic fiction then Count Dracula is the father of all gothic villains, in spite of it being one of the last Gothic fiction novels to be written. It’s a wo rarely. ", "accepted" : "1" , "reviewDate" : "2015-08-15 02:50:15.0"},
{ "username" : "wolv", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "The book does have some serious flaws. For one thing, it is an abandoned WIP, ending abruptly with his passage to England in 1757. He also laid it down in the middle for a long time, and the second half is markedly different from the first; when he starts again, he repeats himself quite a bit, and then goes into this rather preachy and (to me) boring discussion of virtue, and how he attempted to become a Better Person through and Indian War a little dull in parts.", "accepted" : "1" , "reviewDate" : "2015-09-15 02:50:15.0"},
{ "username" : "jack", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "They don't write novels like this anymore. That's because they make television drama series and soap operas instead. To my mind, this novel is the 19th Century equivalent of a long-running and compelling television series. I can readily imagine being a reader of the Journal des Débats between August 1844 and January 1846, impatiently waiting for the next installment of Le Comte de Monte Cristo to be claiming at each plot development, gasping at every cliff-hanger. ", "accepted" : "1" , "reviewDate" : "2015-10-15 02:50:15.0"},
{ "username" : "thor", "bookName" : "A Life of Walt Whitman", "content" : "In his way, Walt Whitman just as boldly challenged the social and cultural customs of the United States of his era as Oscar Wilde did of his. Perhaps he was more circumspect in handling his private affairs. Perhaps the fact that he had no wife and children to neglect and made no mistake of having an affair with an upper class young man with a very powerful and vindictive parent and primarily wrote sensual yet universal poetry in the avoidance of having his entire existence blackballed. ", "accepted" : "1" , "reviewDate" : "2014-01-15 02:50:15.0"},
{ "username" : "thor", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "The most egregious problem for me was the lack of characterization. This was especially true for the female and Native American characters in the book. Women could be dived into four categories: prostitutes, robot prostitutes, former prostitutes, and women who can't understand why their men like prostitutes. The depiction of Native Americans was so one dimensional and borderline racist that it made my skin crawl. prostitutes and Indians,", "accepted" : "1" , "reviewDate" : "2014-02-15 02:50:15.0"},
{ "username" : "jack", "bookName" : "Literary Landmarks of Venice", "content" : "I admit that I was disappointed when I realized that this turned out to be fiction, only and only because I had been told otherwise by author himself while reading the preface. I mean, what’s with the contradiction? I couldn’t understand the pretense. Why pretend this is a real story when it’s a beautiful fiction? What’s wrong with fiction? I admit, as I reached the end of the book, I came to realize why the author tried to portray", "accepted" : "1" , "reviewDate" : "2014-03-15 02:50:15.0"},
{ "username" : "spiderman", "bookName" : "Mazeppa", "content" : "It is through entertainment, 1930's stage vaudeville, that the condition is spread through the wider population. The presumably hidden or at least repressed culture of Soviet consumer society is shown for what it is - impressed as deeply as in any capitalist society by the linguistic distortions of brand names and wealth without purpose. The 'watching mass' has no idea that it is being shown itself, literally exposed, in all its mendacious cupidity.", "accepted" : "1" , "reviewDate" : "2014-04-15 02:50:15.0"},
{ "username" : "supergirl", "bookName" : "Adventures of Huckleberry Finn", "content" : "It is this spiritual elsewhere that Bulgakov has intruding on and disrupting Russian civil society. In time-honoured fashion, the intruders are portrayed as devils who are able to exploit the presumptuous conceits of this society, especially those of the literary elite of the MASSOLIT, the state-run literary guild. It is the writers who sense this intrusion first and it is they who are quite properly driven mad - or to their death - by it. ", "accepted" : "1" , "reviewDate" : "2014-05-15 02:50:15.0"},
{ "username" : "spiderman", "bookName" : "The Adventures of Tom Sawyer", "content" : " It doesn't really matter that you've read the book before because reading this book is not about newness. This book is more like the bannister you grab onto when you're going down dark stairs. You want to feel the same smooth and solid wood that you've felt a thousand times. Because what you are asking this book to do one more time is to remind you. Re-mind-you as in re-setting your mind again so that it is re-aligned with those truths that have always rung true to you.", "accepted" : "1" , "reviewDate" : "2014-06-15 02:50:15.0"},
{ "username" : "misho", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "characterization that is fairly multi-culti without making it an issue and doesn't treat females like a bunch of sex objects (cough, cough, Brent Weeks), but instead like people trying to live how they know, and be as tough as they need to to survive. Side characters were particularly interesting and unique, and I rather liked they they didn't always 'group up' and stay together", "accepted" : "1" , "reviewDate" : "2014-07-15 02:50:15.0"},
{ "username" : "batman", "bookName" : "Dracula", "content" : "On initial inspection the plot of the book can be summed up in a few short sentences: Dracula wishes to create more vampires in Victorian London; his attempts are thwarted and he and his kind are exterminated. But, the novel is so much more than that. It represents Victorian fears and fancies; it is a comment on women’s position in society and underpins their sexual desires (and perhaps fears.) It suggests a struggle between modernity and science with religion and superstition. ", "accepted" : "1" , "reviewDate" : "2014-08-15 02:50:15.0"},
{ "username" : "misho", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "This is a wonderfully inspiring Read. It's a small book packed with great insights into virtuous living. His curiosity and observation of the world around him lead him to live an amazingly full life in which he accomplished much for the good of mankind. All this combined with his wit and writing style make it enjoyable to read and truly encourages the reader towards self improvement. I'm actually reading it again right now. It's great for new year's resolutions.", "accepted" : "1" , "reviewDate" : "2014-09-15 02:50:15.0"},
{ "username" : "supergirl", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "It’s far from a plausible story and it’s fair to say that the theme of revenge is more successfully realised than is the theme of redemption. The plot is indeed totally over the top, with elements of fable and fairy tale, replete with Orientalist imagery which for me brought to mind The Arabian Nights. Luckily for such an intricately plotted novel, the story moves along at a cracking pace, much of it in dialogue, which makes for an easy read notwithstanding the novel’s length. ", "accepted" : "1" , "reviewDate" : "2014-10-15 02:50:15.0"},
{ "username" : "spiderman", "bookName" : "A Life of Walt Whitman", "content" : "I was excited to read this book, I hadn't read a biography of Whitman before, and it didn't let me down as far as facts go... Kaplan provides enough interesting points about Whitman's life that I felt the book was worth reading. On the other hand, the way it is written was less than stellar - it felt more like a collection of disjointed notes rather than a coherent narrative. In the end I finished it only because I was interested in Whitman's life, not because the book itself was interesting.", "accepted" : "1" , "reviewDate" : "2013-01-15 02:50:15.0"},
{ "username" : "samer", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "At the very least, atmosphere should be drawn in this iconic Western setting, but the writing is so unappealing and bland, it does not even manage that. Aside from all this set dressing, the familiar story brings nothing new in the telling. Finally, the frankly appalling treatment of women and minorities detract even further. In spite of possessing magical power sufficient to beat back the western powers.", "accepted" : "1" , "reviewDate" : "2013-02-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "Literary Landmarks of Venice", "content" : "Chiyo is a slave, being trained for the sole purpose of pleasuring men. Men that mean nothing to her and are like alien beings. Up to this point, not a single person has shown her any kindness without ill intentions and when she is about to lose her faith in humanity, a man appears out of nowhere and shows her true kindness. Finally, a man means something to her. One of these men that she is supposed to serve has a face and value to her.", "accepted" : "1" , "reviewDate" : "2013-03-15 02:50:15.0"},
{ "username" : "misho", "bookName" : "Mazeppa", "content" : "If the medieval troubadours are not enough evidence of the cultural determination of the meaning of love, surely the varieties of love articulated in Shakespeare’s Sonnets, and accepted by generations since, clinch the case. Any society that attempts to limit what love, in all its variants, might mean is doomed by its own contradictions; and not just the Soviet variety. But it is Bulgakov’s conception of divine love that I find the most disturbing aspect of the piece.", "accepted" : "1" , "reviewDate" : "2013-04-15 02:50:15.0"},
{ "username" : "mario", "bookName" : "Adventures of Huckleberry Finn", "content" : "The existence of evil is typically explained with one of several largely inadequate theories: Evil is a spontaneous development of a rebellious force against the goodness of God and His works; Evil is not an autonomous force but merely the localised absence of the divine within creation; Evil is actually inherent in a world that was formed by a subsidiary god.", "accepted" : "1" , "reviewDate" : "2013-05-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "The Adventures of Tom Sawyer", "content" : "Simple truths you know as true but will never be able to prove. Like the truth that life feels like a big battle that can be lost if you don't muster up some courage for the fight; or the truth that there is an evil force out there that seems very real and seeks to destroy us and will do so unless somehow we find the greater force that wants to live; and this other one: that you are blessed if you can find a friend or two to help you along the way.", "accepted" : "1" , "reviewDate" : "2013-06-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "Of all the characters, the villain was a bit of a trope. Build-up was scary; actuality was a bit like Paul Reubens in the original Buffy. I also could have passed on the conceit of the weird dude in the beginning approaching Briar about writing a biography. Not sure where it got the story, except some navel-gazingness. Might have incited the kid to leave, but then again, it might not have. Oh wait, I get it. It was a way to introduce backstory. ", "accepted" : "1" , "reviewDate" : "2013-07-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "Dracula", "content" : "Whether you have read it or not, we all know loosely the story of Dracula. Although I assume a lot of people think of it as the bloodthirsty vampire book it definitely is not. Have no doubts this is a horror novel but not like those of modern day, the horror here is perceived as much as it is read, simply by the amazing words of Bram Stoker. There is no real gore here - this is not the Hollywood Dracula, nor is it Buffy the Vampire Slayer or Interview with the Vampire.", "accepted" : "1" , "reviewDate" : "2013-08-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "Franklin first of all affirms that he would live his life over again unchanged, were he given the opportunity. Compare this with Nietzsche’s assertion that such would be repugnant to most men. Thus one can see that Franklin was essentially a content and optimistic man. ", "accepted" : "1" , "reviewDate" : "2013-09-15 02:50:15.0"},
{ "username" : "ethan", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "Characterisation is somewhat sacrificed in the process of weaving the many strands of the plot together. While the Count himself is a compelling character, other characters are less so and female characters in particular are rather flat. One exception is Eugénie Danglars, who has the potential to be very interesting in her own right, although not enough time is spent with her for her potential to be fully realised. However, deficiencies in characterisation are more than made up. ", "accepted" : "1" , "reviewDate" : "2013-10-15 02:50:15.0"},
{ "username" : "superman", "bookName" : "A Life of Walt Whitman", "content" : "I made the best try at reading this book but after 199 pages I have called it quits. I was very interested in Whitman and this book was certainly a complete history of him. However, and its a big however, this book is an ordeal to read. It's pace is as arduous, and convoluted as any work I have ever read. Mr. Kaplan certainly knows his stuff when it comes to Whitman, but I am beat by the style and overall mass of fact that is presented. I have acquired another book, ", "accepted" : "1" , "reviewDate" : "2012-01-15 02:50:15.0"},
{ "username" : "ethan", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "I'm a little confused by so many poor reviews of this book. Not having read anything else by Mike Resnick, maybe there's a big disconnect between his style here and the rest of his work. Or possibly, fans of real Old West history were expecting something in a more solidly plausible alternate history vein, as opposed to this which is more pure steampunk Weird West fantasy. ", "accepted" : "1" , "reviewDate" : "2012-02-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "Literary Landmarks of Venice", "content" : "An interesting and thought-provoking book by an autistic scientist, a Ph.D. in animal science, who is a professor at Colorado State University. This book was written in collaboration with another scientist, also a Ph.D., who specializes in neuropsychiatry and who is also the mother of two of three sons with autism. ", "accepted" : "1" , "reviewDate" : "2012-03-15 02:50:15.0"},
{ "username" : "mario", "bookName" : "Mazeppa", "content" : "Part one of the novel opens with a direct confrontation between Berlioz, the atheistic head of the literary bureaucracy, and an urbane foreign gentleman (Woland), who defends belief and reveals his prophetic powers. Berlioz brushes off the prophecy of his death, but dies pages later in the novel. The fulfillment of the death prophecy is witnessed by Ivan Ponyrev, a young and enthusiastically modern poet. He writes poems under the alias Bezdomny ", "accepted" : "1" , "reviewDate" : "2012-04-15 02:50:15.0"},
{ "username" : "misho", "bookName" : "Adventures of Huckleberry Finn", "content" : "Considering that The Lord of the Rings is one of the most popular books of the last century, it's surprising to see how few reviews there are here. I get the impression that many people feel guilty about liking it. It's a phase you go through, and the less said about it, the better. I think this is unfair to the book, which, I am prepared to argue, is a whole lot better than it's generally made out to be; I don't think its huge success is just evidencl. ", "accepted" : "1" , "reviewDate" : "2012-05-15 02:50:15.0"},
{ "username" : "mario", "bookName" : "The Adventures of Tom Sawyer", "content" : "The ending. I'm admitting it. I ABSOLUTELY DETESTED THE ENDING. I went through ALL of that, and the characters went through all the torture, I really, really wish there had been a happy, peaceful ending. That ending made me want to throw the book out the window. Other than the ending, I ADORED the entire book. And also I love Elanor. And Sam and Rose. AND SAM AND BILL THE PONY. AND SAM AND FRODO. BASICALLY I ADORED SAM.", "accepted" : "1" , "reviewDate" : "2012-06-15 02:50:15.0"},
{ "username" : "mario", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "Speaking of the end, it was a strange mix-up of unfinished and happily ever after (oh stop, that didn't give anything away). Quite a few unanswered questions. While part of me likes to have everything explained, it just isn't possible in a book of this length; I was left with intriguing questions about the Blight, about the Civil War, and about the people in Seattle.", "accepted" : "1" , "reviewDate" : "2012-07-15 02:50:15.0"},
{ "username" : "mario", "bookName" : "Dracula", "content" : "The horror comes more of a building of fear - based mainly on the fact that we all know the general story and all understand what should be happening. Think of it as like having a fear of spiders or snakes and you find one in your house. You go to get something to kill it and return to find it gone. Now you know WHAT it is but not where it is or when it will resurface, but it is there, it is present.", "accepted" : "1" , "reviewDate" : "2012-08-15 02:50:15.0"},
{ "username" : "supergirl", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "This was exciting, once I found out it really was his autobiography! I couldn't believe it at 1st. Turned out to be divided roughly into two parts, the 1st starting with his family history and younger years, and the second coming later after a break. He was in his 80s, and his public had encouraged him to continue. The 2nd part is a little slower but still informative. The book is not very long, not a huge tome.", "accepted" : "1" , "reviewDate" : "2012-09-15 02:50:15.0"},
{ "username" : "groot", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "What does it say about me as a critic when the best book I’ve read all year was first serialized in the 1840s? From start to finish thoroughly enjoyable, Alexandre Dumas’ 1200 page revenge epic The Count of Monte Cristo wastes little time in not thrusting the plot along, quite violently so at times, and includes within a brief, sketchy history of the return of Napoleon and his subsequent second defeat, a primer on hashish, and a proto-seed for the detective tale..", "accepted" : "1" , "reviewDate" : "2012-10-15 02:50:15.0"},
{ "username" : "logan", "bookName" : "A Life of Walt Whitman", "content" : "A biography always to some degree has to set the book’s subject into his or her cultural context but it is unlikely a book ever does that better than this biography of Walt Whitman. Reynolds puts the reader into New York in the mid-1800’s and does it in a way that never appears as “filler.” Whitman is given full context as a poet and as a 19th century American. All the issues surrounding Whitman, from his sexual orientation to the change in his poetry over his lifetime to his public.", "accepted" : "1" , "reviewDate" : "2011-01-15 02:50:15.0"},
{ "username" : "mario", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "While I expect to find a lot of hand-waving in this kind of fantastical alternate history, this book simply had too many elements that required a suspension of any kind of common sense. Robotic whores, electronic tracking devices, electricity with no known source, bullet-proof brass, zombies, vampires, shamanistic magic... It's like Resnick threw darts at a list of elements from other fantastical-type books and hoped it'd appeal to lots of people as a result. ", "accepted" : "1" , "reviewDate" : "2011-02-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "Literary Landmarks of Venice", "content" : "I really enjoyed this book. I loved the animal-by-animal breakdown of what is know about how we can make their lives better physically and emotionally. I love how she works to improve animal welfare both academically and within the meat industries. A very practical viewpoint. Although she can be at times repetitive and a little dry, Temple Grandin is a treasure and a boon to animal lovers and owners everywhere. Although not exhaustive, this book gives a thorough introduction intO.", "accepted" : "1" , "reviewDate" : "2011-03-15 02:50:15.0"},
{ "username" : "groot", "bookName" : "Mazeppa", "content" : "Margarita enters naked into the realm of night after she learns to fly and control her unleashed passions. (She takes violent retribution on the literary bureaucrats who had condemned her beloved to despair.) She takes her enthusiastic maid Natasha with her, to fly over the deep forests and rivers of the USSR. She bathes and returns to Moscow with Azazello, her escort, as the anointed hostess for Satan's great Spring Ball. Standing by h her pains.", "accepted" : "1" , "reviewDate" : "2011-04-15 02:50:15.0"},
{ "username" : "batman", "bookName" : "Adventures of Huckleberry Finn", "content" : "I don't think the morality play is the real kernel either. What makes LOTR a unique book, and one of the most ambitious experiments in literary history, is Tolkien's use of names. All authors knows how important names are, and use them to suggest character; though when you think about what is going on, it is rather surprising how much can be conveyed just by a name. Proust has a couple of long discussions about this, describing in great detail,", "accepted" : "1" , "reviewDate" : "2011-05-15 02:50:15.0"},
{ "username" : "samer", "bookName" : "The Adventures of Tom Sawyer", "content" : "thank you. Thank you for this wonderful place called Middle Earth. Thank you not only for its joyful lands but for the perilous ones too. Thank you for Aragorn, whom I shall call my own King till my last breath. Thank you for the most amazing friendship between an Elf and a Dwarf, for those four little Halflings, Hobbits, who had more courage than Men ever had. Thank you for showing us that even a small person can change the world. Thank you.", "accepted" : "1" , "reviewDate" : "2011-06-15 02:50:15.0"},
{ "username" : "flash", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "engaging but decidedly minor yarn featuring brave women, pirate airships, a zombie plague, and a battered and barricaded alternate seattle. the steampunk elements are of the american west variety, so as far as the atmosphere conveyed, this is more muggy days than foggy nights. enjoyable for the most part, although the highly tedious and annoying character of the son made the last third tough-going at times.", "accepted" : "1" , "reviewDate" : "2011-07-15 02:50:15.0"},
{ "username" : "superman", "bookName" : "Dracula", "content" : "Benjamin Franklin's autobiography is perfect except for one thing, its only half finished!Franklin was prevented from completing it, by becoming involved in the American Revolution.Later going as a diplomat to Paris, to get French help.Born in Boston in 1706, to Josiah Franklin and his wife Abiah. A good student in his youth but the family lacked the money to send him to college.", "accepted" : "1" , "reviewDate" : "2011-08-15 02:50:15.0"},
{ "username" : "ethan", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "Benjamin Franklin's autobiography is perfect except for one thing, its only half finished!Franklin was prevented from completing it, by becoming involved in the American Revolution.Later going as a diplomat to Paris, to get French help.Born in Boston in 1706, to Josiah Franklin and his wife Abiah. A good student in his youth but the family lacked the money to send him to college.", "accepted" : "1" , "reviewDate" : "2011-09-15 02:50:15.0"},
{ "username" : "flash", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "Sensing the malevolence in Villefort’s young wife, he introduces her to a sleeping draught/poison of his own devising, with which she begins to poison members of the prosecutor’s family in an attempt to secure a sizable inheritance for her son by a previous marriage. Through one scheme after another he reduces the proud banker that Danglars has become to a penniless wreck. A similar betrayal in Fernand’s past is resuscitated in part by the Count.", "accepted" : "1" , "reviewDate" : "2011-10-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "A Life of Walt Whitman", "content" : "Am enjoying the book greatly. Love the style of writing but David S. Reynolds. A lot of information that as an immigrant I was not aware of about life in the states at the time Whitman lived. Very vividly written, enjoying the stories and understanding our cultural changes that have occurred for a long time. I suggest Immigrants to read this book amongst some of his other books as well.", "accepted" : "1" , "reviewDate" : "2010-01-15 02:50:15.0"},
{ "username" : "wolv", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "A steampuck retelling of the famous shootout at the O.K. Corral. Some parts of the story worked well and one seems somewhat contrived. The Bat Masterson story arc exploited a pun on his name yet as a character he was dissapointing.", "accepted" : "1" , "reviewDate" : "2010-02-15 02:50:15.0"},
{ "username" : "liam", "bookName" : "Literary Landmarks of Venice", "content" : "So, there I am, reading the section on cats in my bed, waving the cat-fishing pole about, and Mao takes some sort of crazy course-correcting jump and scratches my nose and chin. This morning I look as if I attended Heidelberg. And I didn't make the cat happy, either, because he didn't like the smell of the antibiotic ointment or the band-aids.", "accepted" : "1" , "reviewDate" : "2010-03-15 02:50:15.0"},
{ "username" : "ethan", "bookName" : "Mazeppa", "content" : "The woman had been raped and killed her resulting infant. Her punishment was to wake each morning and find the same handkerchief by which she had killed the child lying on her nightstand. Satan grants her first wish and offers her another, saying that Margarita's first wish was unrelated to her own desires. For her second wish, she chooses to liberate the Master and live in poverty-stricken love with him. Neither Woland nor Yeshua appreciates her chosen way of life. ", "accepted" : "1" , "reviewDate" : "2010-04-15 02:50:15.0"},
{ "username" : "wolv", "bookName" : "Adventures of Huckleberry Finn", "content" : "Perhaps the simplest way to demonstrate the magnitude of Tolkien's achievement is the fact that it's proven impossible to copy it; none of the other fantasy novels I've seen have come anywhere close. Tolkein's names lend reality to his world, because he put so much energy into the linguistic back-story, and before that worked for decades as a philologist. Basically, he was an extremely talented person who spent his whole life training..", "accepted" : "1" , "reviewDate" : "2010-05-15 02:50:15.0"},
{ "username" : "wolv", "bookName" : "The Adventures of Tom Sawyer", "content" : "There is magic in a children's classic that can make mothers and daughters laugh together at the silliness of naughty boys, and at the fact that very little has changed in the dynamics of childhood friendships, despite the time that has passed since the novel was written.", "accepted" : "1" , "reviewDate" : "2010-06-15 02:50:15.0"},
{ "username" : "spiderman", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "Boneshaker is very different from other Steampunk books that I've read (and enjoyed). I think it's considered Steampunk because there are airships (not enough, though!) and a few machines that could be considered in the historical Sci Fi realm. Other than that, it does not have any of the characteristics that I look forward to in Steampunk. No adventure. No cool gadgets or scientific experiments (the breathing masks just don't count). ", "accepted" : "1" , "reviewDate" : "2010-07-15 02:50:15.0"},
{ "username" : "flash", "bookName" : "Dracula", "content" : "I was rather disappointed by this classic. It started out with promise, especially the Jonathan Harker bits. Then all the male characters descended into blubbering worshippers of the two female characters, and by the end of the novel, I was wishing Dracula could snack on all of them and be done with it. I kept having to put it aside and read chapters in between other books, but I managed to finish it at last.", "accepted" : "1" , "reviewDate" : "2010-08-15 02:50:15.0"},
{ "username" : "aaron", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "There is no better life book, and it is so effective because it does not seek to be a self-help book. This autobiography is really just a look into the life of a person who sought only improvement in his own person and engaged in continuous self-reflection to achieve that end. He advocates pillars of morality that should not bend and even explains his efforts to be perfect, ultimately to determine we can't be perfect, but the effort remains worthy.", "accepted" : "1" , "reviewDate" : "2010-09-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "One of the best books I have ever read! I am speechless after reading this novel. This is one of those books, which after you finish the last page, you just stare into the wall for hours on end, contemplating all the things you have read in the book, all the things it has taught you, all the things you promised yourself to remember. Oh, this book has a soul and it has taken mine on an unforgettable journey. Literature such as in this book moves me to tears. ", "accepted" : "1" , "reviewDate" : "2010-10-15 02:50:15.0"},
{ "username" : "ethan", "bookName" : "A Life of Walt Whitman", "content" : "Multitudes is a one-man play about the life and times of Walt Whitman. My wife and I wrote the play and it has been performed nationally and internationally. The play deals with Walt’s sexuality, slavery, the Civil War and Lincoln. Walt Whitman’s America was a joy to read and provided me with new contextual information that is invaluable as a self-taught student and actor/channeler of Walt Whitman.", "accepted" : "1" , "reviewDate" : "2017-01-16 02:50:15.0"},
{ "username" : "spiderman", "bookName" : "Grahams Magazine, Vol. XXX, No. 2, February 1847", "content" : "So how do you breathe new life into a story that has been told as many times as the shootout at the Ok corral? Mr. Resnick does a great job by adding some steam punk style inventions by Thomas Edison that are built by Ned Buntline and you have a pretty good starting point. Add to that real Indian magic that has kept the white man at bay, an undead gunslinger and a Bat Masterson that actually turns into a giant bat and you have a very interesting.", "accepted" : "1" , "reviewDate" : "2017-02-17 02:50:15.0"},
{ "username" : "liam", "bookName" : "Literary Landmarks of Venice", "content" : "A very interesting read. Temple explores the emotional needs of a wide variety of animals - the chapters are devoted to dogs, cats, horses, cows, pigs, chickens, wildlife, and zoos - and what humans can do to improve these animals' lives. I found it more and more interesting as the chapters progressed; as curious as I am about the emotional needs of housecats, Temples' expertise lies in the world of big animals on farms and in zoos, and she has lots of opinions.", "accepted" : "1" , "reviewDate" : "2017-03-01 02:50:15.0"},
{ "username" : "batman", "bookName" : "Mazeppa", "content" : "To start, the characterization in this book is near zero. Although there is a point where some barely discernable personality traits become apparent in one or two of the characters, by the time the reader makes it this far the show is nearly over. And if by curtain call the reader discovers Woland and his retinue to be even remotely interesting.", "accepted" : "1" , "reviewDate" : "2017-04-04 02:50:15.0"},
{ "username" : "jack", "bookName" : "Adventures of Huckleberry Finn", "content" : "The Fellowship of the Ring begins with the Shire and winds its way through the barren lands that lie on the way to Mordor. I tried to read this part of the book once, but DNF it then. Then I picked up the trilogy bound in one volume and went through it fairly steadily.", "accepted" : "1" , "reviewDate" : "2017-05-11 02:50:15.0"},
{ "username" : "flash", "bookName" : "The Adventures of Tom Sawyer", "content" : "Is it sort of weird that I want to do this? I mean it would be such a fun surprise for people or bad depending on what they thought of you. Imagine going to the funeral of your sworn enemy and then he bursts through the door, you’d be so disappointed or as equally amazed if you just buried your best friend and he turns up to say hi. ", "accepted" : "1" , "reviewDate" : "2017-05-42 02:50:15.0"},
{ "username" : "logan", "bookName" : "A Christmas Carol in Prose Being a Ghost Story of Christmas", "content" : "I really wanted to like this one - my first real foray into steampunk, which I've always found aesthetically amusing, at least - but somehow, it just didn't do it for me. ", "accepted" : "1" , "reviewDate" : "2017-07-11 02:50:15.0"},
{ "username" : "logan", "bookName" : "Dracula", "content" : "Let's talk about major issues, because review space is limited and I believe everyone knows the basics of the plot. Evil vampire, blood-sucking fiend, lives in Transylvania, moves to London, and fucks with the wrong people. (Did NOT know who he was fucking with, as Riddick would say. LOL) You know the drill. Besides having 217 status updates - with many quotes continued in the comments, I had copious notes and also a running list of vocabulary words that I learned from Dracula. :)", "accepted" : "1" , "reviewDate" : "2017-08-15 02:50:15.0"},
{ "username" : "frank", "bookName" : "The Autobiography of Benjamin Franklin", "content" : "Benjamin Franklin invented the American Fire Department, wood stoves, and the American system of government. You would think, then, that he'd invent some way of writing an autobiography that wasn't boring as hell. But no. Franklin loves his books, and he also loves self-improvement (the best parts of this are his bizarre charts where he rates himself on a 13-point scale of morality).", "accepted" : "1" , "reviewDate" : "2017-09-20 02:50:15.0"},
{ "username" : "wolv", "bookName" : "The Count of Monte Cristo, Illustrated", "content" : "this book is gooooood!", "accepted" : "1" , "reviewDate" : "2017-10-21 02:50:15.0"}]

